Repository: torchbox-forks/wagtail-2fa
Catalog: src/wagtail_2fa/locale/*/LC_MESSAGES/django.po
Languages: nl

source: OTP token
nl: Tweestapsverificatiecode

source: Enter the numeric code displayed on your device after scanning the QR code
nl: Voer de numerieke code in die op uw apparaat verschijnt na het scannen van de QR code

source: Name
nl: Naam

source: The human-readable name of this device.
nl: Een naam waaraan je dit apparaat makkelijk kan herkennen.

source: Current password
nl: Huidig wachtwoord

source: As an extra security measure, we need your current password.
nl: Als extra beveiligingsmaatregel vragen we je om je wachtwoord.

source: Invalid token. Please make sure you have entered it correctly.
nl: Ongeldige code. Controleer of je de code correct hebt ingevuld.

source: Invalid password
nl: Ongeldig wachtwoord

source: Delete 2FA device
nl: Verwijder 2FA apparaat

source: Two Factor Settings
nl: Tweestapsverificatieinstellingen

source: Do you want to delete the device?
nl: Wil je dit 2FA apparaat verwijderen?

source: Cancel
nl: Annuleer

source: Remove device
nl: Verwijder 2FA apparaat

source: Add new 2FA device
nl: Nieuw 2FA apparaat

source: <p> Two-Factor authentication is a method for making your account more secure, by requiring you to provide an additional piece of evidence (a factor) next to your password. </p> <p> The most common way of providing this secondary factor, is by having one of your devices generate a random code that changes every minute. This is called a One Time Password. </p> <p> For generating codes, you can use one of the following apps. You might even have them installed already. <ul> <li>Google Authenticator for iOS or Android</li> <li>Microsoft Authenticator</li> <li>Authy for iOS or Android</li> <li> A password manager like 1Password, that also supports generating One-Time-Passwords </li> </ul> </p> <p> To configure two-factor authentication for your Wagtail CMS account, install one of those apps and scan the below QR code. Note that if you lose or reset your phone, you will no longer be able to log in. </p>
nl: <p> Tweestapsverificatie (2FA) is een manier om je account extra te beveiligen door middel van extra bewijs dat jij het bent (een tweede stap) boven op je wachtwoord. </p> <p> De meest gebruikelijke implementatie van een tweede stap is een van je apparaten een willekeurige code te laten genereren die elke minuut verandert. Dit heet een tweestapsverificatiecode (een eenmalig geldig wachtwoord). </p> <p> Om deze codes te genereren kun je een van de volgende apps gebruiken. Het kan zijn dat je een van deze apps al geïnstalleerd hebt. <ul> <li>Google Authenticator voor iOS of Android</li> <li>Microsoft Authenticator</li> <li>Authy voor iOS of Android</li> <li> Een wachtwoord manager, zoals 1Password, die het genereren van One-Time-Passwords ondersteunt. </li> </ul> </p> <p> Om Tweestapsverificatie in te stellen voor je Wagtail CMS account installeer je een van de bovenstaande apps en scan je de QR-code hier onder. Houd er rekening mee dat als je je telefoon kwijtraakt of reset je niet meer kan inloggen. </p>

source: If you're unable to scan the image, try pasting the following into your app:
nl: Als het niet lukt om de afbeelding te scannen, probeer dan om het volgende te kopiëren en plakken in je app:

source: Create
nl: Toevoegen

source: Registered 2FA devices
nl: Geregistreerde 2FA apparaten

source: Update device
nl: Bewerk apparaat

source: There are no devices for this user.
nl: Deze gebruiker heeft geen 2FA apparaten.

source: New device
nl: Nieuw 2FA apparaat

source: Sign in
nl: Inloggen

source: Enter your two-factor authentication code
nl: Voer je 2FA verificatiecode in

source: Invalid code
nl: Ongeldige code

source: Signing in…
nl: Bezig met inloggen...

source: Sign out
nl: Uitloggen

source: Device #%s
nl: Apparaat #%s

source: Manage your 2FA devices
nl: Beheer je 2FA apparaten

source: Add or remove devices for 2 factor authentication.
nl: Verwijder of voeg 2FA apparaten toe.

source: Manage 2FA
nl: Beheer 2FA

source: Edit this user
nl: Bewerk deze gebruiker
